Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: (PHP 5 CVS only)
pt_br: yaz_get_option

source: Returns value of option with the name specified.
pt_br: Description

source: This function prepares for a Z39.50 Scan Request.
pt_br: Description

source: Like yaz_connect() this function is non-blocking and only prepares for a search to be executed later when yaz_wait() is called.
pt_br: The RPN query

source: PYP / YAZ Connection Options
pt_br: Tabela 1.

source: Example 1. zend_version() Example
pt_br: Exemplo 1. zend_version() Example

source: Closes a zip file archive.
pt_br: Description

source: Closes a directory entry specified by zip_entry.
pt_br: Description

source: Opens a directory entry in a zip file for reading.
pt_br: Description

source: Opens a new zip archive for reading.
pt_br: Description

source: Reads the next entry in a zip file archive.
pt_br: Description

source: Zlib Compression Functions
pt_br: Funções de Compressão Zlib

source: Preface
pt_br: Próxima

source: Introduction
pt_br: Introdução

source: PHP has come a long way in the last few years.
pt_br: A História do PHP e projetos relacionados

source: Growing to be one of the most prominent languages powering the Web was not an easy task.
pt_br: Criada para ser uma das mais poderosas e proeminentes linguagens da Web não foi uma tarefa fácil.

source: Those of you interested in briefly seeing how PHP grew out to what it is today, read on.
pt_br: Aqueles que se interessaram momentaneamente em ver como o PHP cresceu e se tornou o que é hoje, continue lendo.

source: PHP succeeds an older product, named PHP / FI.
pt_br: PHP / FI

source: PHP / FI was created by Rasmus Lerdorf in 1995, initially as a simple set of Perl scripts for tracking accesses to his online resume.
pt_br: PHP / FI foi criado por Rasmus Lerdorf em 1995, inicialmente como simples scripts Perl como estatísticas de acesso para seu currículo online.

source: He named this set of scripts' Personal Home Page Tools'.
pt_br: Ele nomeou esta sério de script para 'Personal Home Page Tools'.

source: As more functionality was required, Rasmus wrote a much larger C implementation, which was able to communicate with databases, and enabled users to develop simple dynamic Web applications.
pt_br: Como mais funcionalidades foram requeridas, Rasmus escreveu uma implementação C muito maior, que era capaz de comunicar-se com base de dados, e possibilitava à usuários desenvolver simples aplicativos dinâmicos para Web.

source: Rasmus chose to release the source code for PHP / FI for everybody to see, so that anybody can use it, as well as fix bugs in it and improve the code.
pt_br: Rasmus decidiu disponibilizar o código fonte do PHP / FI para que todos pudessem ver, e também usá-lo, bem como fixar bugs e melhorar o código.

source: PHP / FI, which stood for Personal Home Page / Forms Interpreter, included some of the basic functionality of PHP as we know it today.
pt_br: Ele usava variáveis no estilo Perl, interpretação automática de variáveis vindas de formulário e sintaxe embutida no HTML.

source: It had Perl-like variables, automatic interpretation of form variables and HTML embedded syntax.
pt_br: A sua própria sintaxe era similar a do Perl, porém muito mais limitada, simples, e um pouco inconsistente.

source: The syntax itself was similar to that of Perl, albeit much more limited, simple, and somewhat inconsistent.
pt_br: Em 1997, PHP / FI 2.0, a segunda versão da implementação C, obteve milhares de usuários ao redor do mundo (estimado), com aproximadamente 50,000 domínios reportando que tinha PHP / FI 2.0 instalado, agarinhando 1% dos domínios da Internet.

source: By 1997, PHP / FI 2.0, the second write-up of the C implementation, had a cult of several thousand users around the world (estimated), with approximately 50,000 domains reporting as having it installed, accounting for about 1% of the domains on the Internet.
pt_br: Enquanto isto havia milhares de pessoas contribuindo com pequenos códigos para o projeto, e ainda assim By 1997, PHP / FI 2.0, the second write-up of the C implementation, had a cult of several thousand users around the world (estimated), with approximately 50,000 domains reporting as having it installed, accounting for about 1% of the domains on the Internet.

source: PHP / FI 2.0 was officially released only in November 1997, after spending most of its life in beta releases.
pt_br: O PHP / FI 2.0 foi oficialmente lançado somente em Novembro de 1997, após perder a maior parte de sua vida em versões betas.

source: It was shortly afterwards succeeded by the first alphas of PHP 3.0.
pt_br: PHP 3

source: PHP 3.0 was the first version that closely resembles PHP as we know it today.
pt_br: O PHP 3.0 foi a primeira versão que se assemelha ao PHP que nós conhecemos hoje.

source: It was created by Andi Gutmans and Zeev Suraski in 1997 as a complete rewrite, after they found PHP / FI 2.0 severely underpowered for developing their own eCommerce application.
pt_br: Ela foi criada por Andi Gutmans e Zeev Suraski em 1997 e foi totalmente reescrito, após eles descobrirem que o PHP / FI 2.0 poderia ajudá-los a desenvolver suas próprias aplicações de eCommerce.

source: In an effort to cooperate and start building upon PHP / FI 's existing user-base, Andi, Rasmus and Zeev decided to cooperate and announce PHP 3.0 as the official successor of PHP / FI 2.0, and development of PHP / FI 2.0 was mostly halted.
pt_br: No esforço cooperativo e iniciativa de começar o PHP / FI à partir da base-usuário existente, Andi, Rasmus e Zeev decidiram cooperar e anunciar o PHP 3.0 como uma versão oficial de seu sucessor o PHP / FI 2.0, e o desenvolvimento do PHP / FI 2.0 foram descontinuados.

source: One of the biggest strengths of PHP 3.0 was its strong extensibility features.
pt_br: Uma das maiores características do PHP 3.0 era sua forte capacidade de extensibilidade.

source: In addition to providing end users with a solid infrastructure for lots of different databases, protocols and APIs, PHP 3.0 's extensibility features attracted dozens of developers to join in and submit new extension modules.
pt_br: Além de oferecer aos usuários finais uma infraestrutura sólida para diversos bancos de dados, protocolos e APIs, o extensibilidade do PHP 3.0 atraí dezenas de desenvolvedores para se juntar e submeter novos módulos.

source: Arguably, this was the key to PHP 3.0 's tremendous success.
pt_br: Esta é a chave do tremendo sucesso do PHP 3.0.

source: Other key features introduced in PHP 3.0 were the object oriented syntax support and the much more powerful and consistent language syntax.
pt_br: Outras características chaves introduzidas no PHP 3.0 foram o suporte à sintaxe para orientação à objetos e uma sintaxe muito mais poderosa e consistente.

source: The whole new language was released under a new name, that removed the implication of limited personal use that the PHP / FI 2.0 name held.
pt_br: A nova versão da linguagem foi realizada sob um novo nome, que removeu a impressão do limitado uso pessoal que o PHP / FI 2.0 prendeu.

source: It was named plain 'PHP', with the meaning being a recursive acronym - PHP:
pt_br: Ela foi nomeada simplesmente 'PHP', com o significado que é um acrônimo - PHP:

source: By the end of 1998, PHP grew to an install base of tens of thousands of users (estimated) and hundreds of thousands of Web sites reporting it installed.
pt_br: No final de 1998, o PHP obteve uma base the dezenas de milhares de usuários (estimativa) e centenas de milhares de Web sites relatando que o tinham instalado.

source: At its peak, PHP 3.0 was installed on approximately 10% of the Web servers on the Internet.
pt_br: Em seu pico, o PHP 3.0 foi instalado em aproximadamente 10% dos servidores Web da Internet.

source: PHP 3.0 was officially released in June 1998, after having spent about 9 months in public testing.
pt_br: O PHP 3.0 foi oficialmente lançado em Junho de 1998, depois de ter passado aproximadamente 9 meses em testes públicos.

source: By the winter of 1998, shortly after PHP 3.0 was officially released, Andi Gutmans and Zeev Suraski had begun working on a rewrite of PHP 's core.
pt_br: No inverno de 1998, rapidamente após o PHP 3.0 ser oficialmente lançado, Andi Gutmans e Zeev Suraski começaram a reescrever o núcleo do PHP.

source: The design goals were to improve performance of complex applications, and improve the modularity of PHP 's code base.
pt_br: Os objetivos do projeto eram melhorar a performance de aplicações complexas, e melhorar a modularidade do código base do PHP.

source: Such applications were made possible by PHP 3.0 's new features and support for a wide variety of third party databases and APIs, but PHP 3.0 was not designed to handle such complex applications efficiently.
pt_br: Tais aplicações foram possíveis por causa das novas características do PHP 3.0 e o suporte a uma variadade de banco de dados de terceiros e APIs, mas o PHP 3.0 não foi projeto para trabalhar com aplicações muito complexas eficientemente.

source: The new engine, dubbed 'Zend Engine' (comprised of their first names, Zeev and Andi), met these design goals successfully, and was first introduced in mid 1999.
pt_br: A nova engine, dubbed 'Zend Engine' (conhecidos pelos seus primeiros nomes, Zeev e Andi), fazendo desse objetivo um sucesso, e foi introduzida em meados de 1999.

source: PHP 4.0, based on this engine, and coupled with a wide range of additional new features, was officially released in May 2000, almost two years after its predecessor, PHP 3.0.
pt_br: PHP 4.0, baseado nesta engine, e acompanhado com uma série de novas características, foi oficialmente lançada em Maio de 2000, quase dois anos após o seu predecessor, o PHP 3.0.

source: In addition to the highly improved performance of this version, PHP 4.0 included other key features such as support for many more Web servers, HTTP sessions, output buffering, more secure ways of handling user input and several new language constructs.
pt_br: Além da altíssimo melhoramento da performance desta versão, o PHP 4.0 incluiu outras características chave como o suporte para muitos servidores WEb, sessões HTTP, buffer de saída, maneiras mais seguras de manipular input de usuários e muitas construções novas na linguagem.

source: PHP 4 is currently the latest released version of PHP.
pt_br: PHP 4 é a última versão lanaçada do PHP.

source: Work has already begun on modifying and improving the Zend Engine to integrate the features which were designed for PHP 5.0.
pt_br: O trabalho já começou na modificação e melhoramento da Zend Engine para integrar novas características que foram designadas para o PHP 5.0.

source: Today, PHP is being used by hundreds of thousands of developers (estimated), and several million sites report as having it installed, which accounts for over 20% of the domains on the Internet.
pt_br: Hoje, o PHP está começando a ser usado por centenas de milhares de desenvolvedores (estimativa), e muitos milhões de sites reportam que tem o PHP instalado, que explica os 20% de domínios da Internet.

source: PHP 's development team includes dozens of developers, as well as dozens others working on PHP-related projects such as PEAR and the documentation project.
pt_br: PHP 5

source: The future of PHP is mainly driven by it 's core, the Zend Engine.
pt_br: O futuro do PHP é dirigido principalmente pelo seu núcleo, a Zend Engine.

source: PHP 5 will include the new Zend Engine 2.0.
pt_br: PHP 5 irá incluir a nova Zend Engine 2.0.

source: To get more information on this engine, see it 's webpage.
pt_br: Para obter mais informações sobre esta engine, veja esta página.

source: Appendixes
pt_br: Apêndices

source: History of PHP related projects
pt_br: A História dos projetos relacionados ao PHP

source: Appendix A.
pt_br: Apêndice A.

source: As PHP grew, it began to be recognized as a world-wide popular development platform.
pt_br: O PHP cresceu, ele começou a ser reconhecido mundialmente como a plataforma mais popular.

source: One of the most interesting ways of seeing this trend was by observing the books about PHP that came out throughout the years.
pt_br: Uma das maneiras mais interessantes de ver esta tendência é observar os livros sobre PHP que surgirão ao longo dos anos.

source: To the best of our knowledge, the first book dedicated to PHP was' PHP - tvorba interaktivních internetových aplikací '- a Czech book published in April 1999, authored by Jirka Kosek.
pt_br: Até onde nós sabemos, o primeiro livro dedicado ao PHP foi 'PHP - tvorba interaktivních internetových aplikací' - um livro Czech publicado em Abril de 1999, pela autora Jirka Kosek.

source: Next month followed a German book authored by Egon Schmid, Christian Cartus and Richard Blume.
pt_br: No mês seguinte veio o livro Alemão escrito por Egon Schmid, Christian Cartus e Richard Blume.

source: The first book in English about PHP was published shortly afterwards, and was' Core PHP Programming 'by Leon Atkinson.
pt_br: O primeiro livro em Inglês sobre PHP foi publicado logo depois, e foi chamado 'Core PHP Programming' por Leon Atkinson.

source: Both of these books covered PHP 3.0.
pt_br: Todos estes livros falavam sobre o PHP 3.0.

source: While these books were the first of their kind - they were followed by a large number of books from a host of authors and publishers.
pt_br: Quando estes livros eram os primeiros deste tipo - eles inspiraram um grande número de livros de outros autores e editoras.

source: There are over 40 books in English, 50 books in German, and over 20 books in French!
pt_br: Há aproximadamente 40 livros em Inglês, 50 livros em Alemão, e uns 20 livros em Francês!

source: In addition, you can find books about PHP in many other languages, including Spanish, Korean, Japanese and Hebrew.
pt_br: Além disso, você pdoe encontrar livros sobre PHP em muitas outras línguas, incluindo Espanhol, Koreâno, Japonês e Hebrew.

source: Clearly, this large number of books, written by different authors, published by many publishers, and their availability in so many languages - are a strong testimony for PHP 's world-wide success.
pt_br: Obviamente, este grande número de livros, escritos por diferentes autores, publicados por muitas editoras, e disponíveis em muitas línguas - é uma prova do sucesso mundial do PHP.

source: Publications about PHP
pt_br: Publicações sobre PHP

source: To the best of our knowledge, the first article about PHP in a hard-copy magazine was published in the Czech mutation of Computerworld in the spring of 1998, and covered PHP 3.0.
pt_br: Até onde nós sabemos, o primeiro artigo sobre PHP foi publicado em uma revista parecida com a Computerworld na Czech em meados de 1998, e cobria o PHP 3.0.

source: As with books, this was the first in a series of many articles published about PHP in various prominent magazines.
pt_br: Como os livros, este foi um de uma sério de muitos artigos publicados sobre PHP em várias revistas proeminentes.

source: Articles about PHP appeared in Dr.
pt_br: Artigos sobre PHP apareceram no Dr.

source: Dobbs, Linux Enterprise, Linux Magazine and many more.
pt_br: Dobbs, Empresas de Linux, Revistas de Linux e em muitos outros lugares.

source: Articles about migrating ASP-based applications to PHP under Windows even appear on Microsoft 's very own MSDN!
pt_br: Artigos sobre migração de aplicações baseadas em ASP para PHP rodando Windows foram publicadas mesmo na Microsoft e até mesmo na MSDN!

source: Books about PHP
pt_br: Livros sobre PHP

source: PEAR, the PHP Extension and Application Repository (originally, PHP Extension and Add-on Repository) is PHP's version of foundation classes, and may grow in the future to be one of the key ways to distribute both PHP and C-based PHP extensions among developers.
pt_br: PEAR, o repositório da Extensão PHP e da Aplicação (originalmente, Extensão PHP e Repositório Add-on) são as versões das classes da fundação do PHP, e talvez cresçam no futuro para ser um dos caminhos chaves para distribuir o PHP em ambas extensões C e PHP entre os colaboradores.

source: PEAR was born in discussions held in the PHP Developers' Meeting (PDM) held in January 2000 in Tel Aviv.
pt_br: O PEAR nasceu em discussões realizadas nas PHP Developers' Meeting-PMD (Reuniões dos Desenvolvedores do PHP-RDP) realizada em Janeiro de 2000 em Tel Aviv.

source: It was created by Stig S.
pt_br: Foi criada por Sitg S.

source: Bakken, and is dedicated to his first-born daughter, Malin Bakken.
pt_br: Bakken, e é dedicada à sua primeira filha, Malin Bakken.

source: Since early 2000, PEAR has grown to be a big, significant project with a large number of developers working on implementing common, reusable functionality for the benefit of the entire PHP community.
pt_br: Desde o começo de 2000, o PEAR cresceu para ser um grande, e significativo projeto com um largo número de desenvolvedores trabalhando em executar tarefas comuns, funcionalidades reusáveis para o benefício de toda a comunidade PHP.

source: PEAR today includes a wide variety of infrastructure foundation classes for database access, content caching, mathematical calculations, eCommerce and much more.
pt_br: A Iniciativa da Garantia de Qualidade do PHP

source: The PHP Quality Assurance Initiative was set up in the summer of 2000 in response to criticism that PHP releases were not being tested well enough for production environments.
pt_br: A Iniciativa da Garantia de Qualidade do PHP foi criada no verão de 2000 em resposta às críticas sobre as versões do PHP não terem sido testadas o bastante para ambientes de produção.

source: The team now consists of a core group of developers with a good understanding of the PHP code base.
pt_br: O time agora consiste em um grupo de desenvolvedores com um bom entendimento sobre o código base do PHP.

source: These developers spend a lot of their time localizing and fixing bugs within PHP.
pt_br: Estes desenvolvedores gastam muito boa parte do tempo deles localizando e consertando bugs dentro do PHP.

source: In addition there are many other team members who test and provide feedback on these fixes using a wide variety of platforms.
pt_br: PHP-GTK

source: PHP-GTK is the PHP solution for writing client side GUI applications.
pt_br: O PHP-GTK é a solução PHP para aplicações GUI client side (lado-cliente).

source: Andrei Zmievski remembers the planing and creation process of PHP-GTK:
pt_br: Andrei Zmievski recorda o processo de planejamento e criação do PHP-GTK:

source: GUI programming has always been of my interests, and I found that Gtk + is a very nice toolkit, except that programming with it in C is somewhat tedious.
pt_br: A programação GUI sempre foi de meu interesse, e eu achei que o Gtk + é uma ferramenta muito boa, exceto que a programação dela usa o C que algumas vezes é um tédio.

source: After witnessing PyGtk and GTK-Perl implementations, I decided to see if PHP could be made to interface with Gtk+, even minimally.
pt_br: Após testemunhar as implementações do PyGtk e GTK-Perl, eu decidi ver se o PHP poderia ter uma interface Gtk+.

source: Starting in August of 2000, I began to have a bit more free time so that is when I started experimenting.
pt_br: Começando em Agosto de 2000, eu comecei a ter um pouco mais de tempo livre que foi quando eu comecei a experimentar.

source: My main guideline was the PyGtk implementation as it was fairly feature complete and had a nice object-oriented interface.
pt_br: Minha linha guia principal foi a implementação da interface PyGtk.

source: James Henstridge, the author of PyGtk, provided very helpful advice during those initial stages.
pt_br: James Henstridge, o autor do PyGtk, me ajudou muito durante os estágios iniciais.

source: Hand-writing the interfaces to all the Gtk + functions was out of the question, so I seized upon the idea of code-generator, similar to how PyGtk did it.
pt_br: Escrever as interfaces na mão para todas as funções do Gtk + estava fora de questão, então eu tive uma idéia de criar um gerador de código, similar à como o PyGtk foi feito.

source: What cannot be generated automatically can be written by hand in .overrides file.
pt_br: O gerador de código é um programa PHP que lê uma série de arquivos .def contendo as classes Gtk+, constantes, e as informações dos métodos e geradores de código C que irão trabalhar com o PHP.O que não pode ser gerado automaticamente pode ser escrito em arquivos .overrides.

source: Working on the code generator and the infrastructure took some time, because I could spend little time on PHP-GTK during the fall of 2000.
pt_br: Trabalhando no gerador de código e na infraestrutura levou algum tempo, porque eu tinha pouco tempo para trabalhar no PHP-GTK durante o fim de 2000.

source: After I showed PHP-GTK to Frank Kromann, he got interested and started helping me out with code generator work and Win32 implementation.
pt_br: Depois de eu mostrar o PHP-GTK ao Frank Kromann, ele se interessou e começou a me ajudar com o gerador de código e a implementação para Win32.

source: When we wrote the first Hello World program and fired it up, it was extremely exciting.
pt_br: Quando nós escrevemos o primeiro programa 'Hello World' e o rodamos, foi extremamente exitante.

source: The story promptly hit SlashDot.
pt_br: Levou mais alguns meses para deixar o projeto em uma condição apresentável e lançar a versão inicial realizada em 1 de Março de 2001. que logo foi apresentada no SlashDot.

source: Sensing that PHP-GTK might be extensive, I set up separate mailing lists and CVS repositories for it, as well as the gtk.php.net website with the help of Colin Viebrock.
pt_br: Detetando que o PHP-GTK pode ser extensivo, eu decidi separar as listas de discussão e os repositórios CVS para isto, bem como o website gtk.php.net com ajuda de Colin Viebrock.

source: The documentation would also need to be done and James Moore came in to help with that.
pt_br: A documentação também era necessária ser feita e James Moore veio me ajudar com isto.

source: Since its release PHP-GTK has been gaining popularity.
pt_br: Desde sua realização o PHP-GTK vem ganhando popularidade.

source: We have our own documentation team, the manual keeps improving, people start writing extensions for PHP-GTK, and more and more exciting applications with it.
pt_br: Agora, nós temos nosso próprio time de documentação, o manual continua melhorando, as pessoas começam a escrever extensões para o PHP-GTK, e mais e mais aplicativos excitantes com ele.

source: Copyright © 1997, 1998, 1999, 2000, 2001, 2002, 2003 the PHP Documentation Group
pt_br: Duplicating Variable Contents:

source: Chapter 3.
pt_br: Capítulo 3.

source: Installation
pt_br: Instalação

source: You are highly encouraged to take a look at the Apache Documentation to get a basic understanding of the Apache 2.0 Server.
pt_br: PHP and Apache 2.0 compatibility notes

source: Download the most recent version of Apache 2.0 and a fitting PHP version from the above mentioned places.
pt_br: PHP and Apache 2 on Linux

source: Example 3-6.
pt_br: Exemplo 3-6.

source: The recommended setup is to build Apache with the standard prefork MPM-Module.
pt_br: PHP and Apache 2.0 on Windows

source: Example 3-7.
pt_br: Exemplo 3-7.

source: Example 3-8.
pt_br: Exemplo 3-8.

source: Servers-Apache
pt_br: Servidores-Apache

source: This section contains notes and hints specific to Apache installs of PHP, both for Unix and Windows This section contains notes and hints specific to Apache installs of PHP, both for Unix and Windows versions.
pt_br: Esta seção contém notas e dicas específicas para instalações do PHP em Apache, tanto para versões Unix quanto para Windows.

source: We also have instructions and notes for Apache 2 on a separate page.
pt_br: Detalhes ao instalar o PHP com Apache no Unix
